<center> <img SRC="alcohol.jpg" aling="center"/> </center>

<center> <h1 sytle="color:#F7DC6F">Analisis sobre consumo de alcohol </h1> </center>

<p style="text-aling:justify"> Analsis para identificar las caracteristicas del set de datos relacionado al consumo de licor. </p>

<h2 style="color:#F7DC6F"> 1.Carga y estandarizacion de los archivos de datos </h2>

<p> Que se hace en este apartado? </p>

<ol>
    <li> Importar las librerias que se necesitan </li>
    <li> Importar los sets de datos de los CSV </li>
    <li> Revisar los encabezados de los Dataframes </li>
</ol>

<h3 style="color:#F7DC6F"> 1.1.Importacion de liberias </h3>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib as mplt

<h3 style="color:#F7DC6F"> 1.2 Carga de datos </h3>

In [2]:
dfalcohol=pd.read_csv("alcohol.csv")

In [3]:
dfalcohol.shape

(213, 6)

In [4]:
dfalcohol.head()

,country,alcconsumption,incomeperperson,suicideper100th,employrate,urbanrate
0,Afghanistan,0.03,NaN,6.684385,55.700001,24.04
1,Albania,7.29,1914.996551,7.699330,51.400002,46.72
2,Algeria,0.69,2231.993335,4.848770,50.500000,65.22
3,Andorra,10.17,21943.339900,5.362179,NaN,88.92
4,Angola,5.57,1381.004268,14.554677,75.699997,56.70

In [5]:
dfalcohol.tail()

,country,alcconsumption,incomeperperson,suicideper100th,employrate,urbanrate
208,Vietnam,3.91,722.807559,11.653322,71.000000,27.84
209,West Bank and Gaza,NaN,NaN,NaN,32.000000,71.90
210,"Yemen, Rep.",0.20,610.357367,6.265789,39.000000,30.64
211,Zambia,3.56,432.226337,12.019036,61.000000,35.42
212,Zimbabwe,4.96,320.771890,13.905267,66.800003,37.34

<h3 style="color:#F7DC6F"> 1.3. Revisar los encabezados </h3>

In [6]:
dfalcohol.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 213 entries, 0 to 212
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   country          213 non-null    object
 1   alcconsumption   187 non-null    float64
 2   incomeperperson  190 non-null    float64
 3   suicideper100th  191 non-null    float64
 4   employrate       178 non-null    float64
 5   urbanrate        203 non-null    float64
dtypes: float64(5), object(1)
memory usage: 10.1+ KB

<h2 style="color:#F7DC6F"> 2. Manejo de valores faltantes o perdidos </h2>

<p> Que se hace en este apartado? </p>

<ol>
    <li> Contar los valores faltantes por varaibles </li>
    <li> Analisis de imputacion de valores con la media </li>
    <li> Analsis de imputacion de valores string con el dato mas frecuente </li>
    <li> Analisis para eliminar valores faltantes </li>
</ol>

<h3 style="color:#F7DC6F"> 2.1 Contar los valores faltantes o perdidos por variable </h3>

In [7]:
valoresperdidos=dfalcohol.isnull()
valoresperdidos.head()

,country,alcconsumption,incomeperperson,suicideper100th,employrate,urbanrate
0,False,False,True,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,True,False
4,False,False,False,False,False,False

In [8]:
for column in valoresperdidos.columns.values.tolist():
    print(column)
    print(valoresperdidos[column].value_counts())
    print(" ")

country
False    213
Name: country, dtype: int64

alcconsumption
False    187
True      26
Name: alcconsumption, dtype: int64

incomeperperson
False    190
True      23
Name: incomeperperson, dtype: int64

suicideper100th
False    191
True      22
Name: suicideper100th, dtype: int64

employrate
False    178
True      35
Name: employrate, dtype: int64

urbanrate
False    203
True      10
Name: urbanrate, dtype: int64

<h3 style="color:#F7DC6F">2.2.Imputar valores numericos con la media </h3>

In [9]:
avg_norm=dfalcohol["alcconsumption"].astype("float").mean(axis=0)
print("La media de alcconsumption es:", avg_norm)

La media de alcconsumption es: 6.689411764705882

In [10]:
dfalcohol["alcconsumption"].replace(np.nan,6.6,inplace=True)
dfalcohol.head(5)

,country,alcconsumption,incomeperperson,suicideper100th,employrate,urbanrate
0,Afghanistan,0.03,NaN,6.684385,55.700001,24.04
1,Albania,7.29,1914.996551,7.699330,51.400002,46.72
2,Algeria,0.69,2231.993335,4.848770,50.500000,65.22
3,Andorra,10.17,21943.339900,5.362179,NaN,88.92
4,Angola,5.57,1381.004268,14.554677,75.699997,56.70

In [11]:
avg_norm=dfalcohol["incomeperperson"].astype("float").mean(axis=0)
print("La media de incomeperperson es:", avg_norm)

La media de incomeperperson es: 8740.96607617579

In [12]:
dfalcohol["incomeperperson"].replace(np.nan,8741,inplace=True)
dfalcohol.head(5)

,country,alcconsumption,incomeperperson,suicideper100th,employrate,urbanrate
0,Afghanistan,0.03,8741.000000,6.684385,55.700001,24.04
1,Albania,7.29,1914.996551,7.699330,51.400002,46.72
2,Algeria,0.69,2231.993335,4.848770,50.500000,65.22
3,Andorra,10.17,21943.339900,5.362179,NaN,88.92
4,Angola,5.57,1381.004268,14.554677,75.699997,56.70

In [13]:
avg_norm=dfalcohol["suicideper100th"].astype("float").mean(axis=0)
print("La media de suicideper100th es:", avg_norm)

La media de suicideper100th es: 9.640839010502612

In [14]:
dfalcohol["suicideper100th"].replace(np.nan,9.6,inplace=True)
dfalcohol.head(5)

,country,alcconsumption,incomeperperson,suicideper100th,employrate,urbanrate
0,Afghanistan,0.03,8741.000000,6.684385,55.700001,24.04
1,Albania,7.29,1914.996551,7.699330,51.400002,46.72
2,Algeria,0.69,2231.993335,4.848770,50.500000,65.22
3,Andorra,10.17,21943.339900,5.362179,NaN,88.92
4,Angola,5.57,1381.004268,14.554677,75.699997,56.70

In [15]:
avg_norm=dfalcohol["employrate"].astype("float").mean(axis=0)
print("La media de employrate es:", avg_norm)

La media de employrate es: 58.63595508224721

In [16]:
dfalcohol["employrate"].replace(np.nan,59,inplace=True)
dfalcohol.head(5)

,country,alcconsumption,incomeperperson,suicideper100th,employrate,urbanrate
0,Afghanistan,0.03,8741.000000,6.684385,55.700001,24.04
1,Albania,7.29,1914.996551,7.699330,51.400002,46.72
2,Algeria,0.69,2231.993335,4.848770,50.500000,65.22
3,Andorra,10.17,21943.339900,5.362179,59.000000,88.92
4,Angola,5.57,1381.004268,14.554677,75.699997,56.70

In [17]:
avg_norm=dfalcohol["urbanrate"].astype("float").mean(axis=0)
print("La media de urbanrate es:", avg_norm)

La media de urbanrate es: 56.76935960591131

In [18]:
dfalcohol["urbanrate"].replace(np.nan,57,inplace=True)
dfalcohol.head(5)

,country,alcconsumption,incomeperperson,suicideper100th,employrate,urbanrate
0,Afghanistan,0.03,8741.000000,6.684385,55.700001,24.04
1,Albania,7.29,1914.996551,7.699330,51.400002,46.72
2,Algeria,0.69,2231.993335,4.848770,50.500000,65.22
3,Andorra,10.17,21943.339900,5.362179,59.000000,88.92
4,Angola,5.57,1381.004268,14.554677,75.699997,56.70

In [19]:
valoresperdidos=dfalcohol.isnull()
for column in valoresperdidos.columns.values.tolist():
    print(column)
    print(valoresperdidos[column].value_counts())
    print(" ")

country
False    213
Name: country, dtype: int64

alcconsumption
False    213
Name: alcconsumption, dtype: int64

incomeperperson
False    213
Name: incomeperperson, dtype: int64

suicideper100th
False    213
Name: suicideper100th, dtype: int64

employrate
False    213
Name: employrate, dtype: int64

urbanrate
False    213
Name: urbanrate, dtype: int64

In [20]:
dfalcohol.dtypes

country             object
alcconsumption     float64
incomeperperson    float64
suicideper100th    float64
employrate         float64
urbanrate          float64
dtype: object

In [21]:
dfn = dfalcohol.convert_dtypes()
dfn

,country,alcconsumption,incomeperperson,suicideper100th,employrate,urbanrate
0,Afghanistan,0.03,8741.0,6.684385,55.700001,24.04
1,Albania,7.29,1914.996551,7.69933,51.400002,46.72
2,Algeria,0.69,2231.993335,4.84877,50.5,65.22
3,Andorra,10.17,21943.3399,5.362179,59.0,88.92
4,Angola,5.57,1381.004268,14.554677,75.699997,56.7
...,...,...,...,...,...,...
208,Vietnam,3.91,722.807559,11.653322,71.0,27.84
209,West Bank and Gaza,6.6,8741.0,9.6,32.0,71.9
210,"Yemen, Rep.",0.2,610.357367,6.265789,39.0,30.64
211,Zambia,3.56,432.226337,12.019036,61.0,35.42
212,Zimbabwe,4.96,320.77189,13.905267,66.800003,37.34

In [22]:
dfn.dtypes

country             string
alcconsumption     Float64
incomeperperson    Float64
suicideper100th    Float64
employrate         Float64
urbanrate          Float64
dtype: object

In [23]:
dfalcohol.groupby(["country"])["suicideper100th"].agg("sum")

country
Afghanistan            6.684385
Albania                7.699330
Algeria                4.848770
Andorra                5.362179
Angola                14.554677
                        ...
Vietnam               11.653322
West Bank and Gaza     9.600000
Yemen, Rep.            6.265789
Zambia                12.019036
Zimbabwe              13.905267
Name: suicideper100th, Length: 213, dtype: float64

In [39]:
freq = dfalcohol.loc[dfalcohol["country"]=="Vietnam"]
freq.count()

country            1
alcconsumption     1
incomeperperson    1
suicideper100th    1
employrate         1
urbanrate          1
dtype: int64